In [13]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [31]:
s = pd.Series(['A','B','C'], index=[1,2,3])
s

1    A
2    B
3    C
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [32]:
s.index = [11,12,13]
s

11    A
12    B
13    C
dtype: object

## Q3: Retrieve First and second elements.

In [33]:
s[0:2]

11    A
12    B
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [38]:
s2 = pd.Series(['A'], index=[11])
s = pd.concat([s,s2])
print(s)

11    A
12    B
13    C
11    A
11    A
dtype: object

In [40]:
s = s.drop_duplicates()
s

11    A
12    B
13    C
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [43]:
data = {
    'ID': [1, 2],
    'Name': ['Alwaleed', 'Ali'],
    'GPA': [4.7, 3.8]
       } 
students_df = pd.DataFrame(data, columns=['ID', 'Name', 'GPA'])
students_df

   ID      Name  GPA
0   1  Alwaleed  4.7
1   2       Ali  3.8

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [49]:
df = pd.read_csv('educ_figdp_1_Data.csv')
print(df.head())

   TIME                            GEO  \
0  2000  European Union (28 countries)
1  2001  European Union (28 countries)
2  2002  European Union (28 countries)
3  2003  European Union (28 countries)
4  2004  European Union (28 countries)

                                            INDIC_ED Value Flag and Footnotes
0  Total public expenditure on education as % of ...     :                NaN
1  Total public expenditure on education as % of ...     :                NaN
2  Total public expenditure on education as % of ...  5.00                  e
3  Total public expenditure on education as % of ...  5.03                  e
4  Total public expenditure on education as % of ...  4.95                  e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [52]:
print(df.loc[1]) # Selecting a single row
df.loc[[1,3]] # Selecting multiple rows
" uses index labels as references "

TIME                                                               2001
GEO                                       European Union (28 countries)
INDIC_ED              Total public expenditure on education as % of ...
Value                                                                 :
Flag and Footnotes                                                  NaN
Name: 1, dtype: object

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e

In [55]:
print(df[1:4])  # Selecting three rows using slicing
df[1:4:2]  # Selecting two rows using slicing
"uses slicing to select rows based on their positions."
# uses positions as references

   TIME                            GEO  \
1  2001  European Union (28 countries)
2  2002  European Union (28 countries)
3  2003  European Union (28 countries)

                                            INDIC_ED Value Flag and Footnotes
1  Total public expenditure on education as % of ...     :                NaN
2  Total public expenditure on education as % of ...  5.00                  e
3  Total public expenditure on education as % of ...  5.03                  e

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e